[{"model": "blog.category", "pk": 1, "fields": {"name": "Breakfast"}}, {"model": "blog.category", "pk": 2, "fields": {"name": "Lunch"}}, {"model": "blog.category", "pk": 3, "fields": {"name": "Dinner"}}, {"model": "blog.category", "pk": 4, "fields": {"name": "Snacks"}}, {"model": "blog.category", "pk": 8, "fields": {"name": "Soups"}}, {"model": "blog.category", "pk": 9, "fields": {"name": "Bowls"}}, {"model": "blog.category", "pk": 10, "fields": {"name": "Salads"}}, {"model": "blog.post", "pk": 21, "fields": {"title": "Grapefruit with fried bananas", "slug": "grapefruit-with-fried-bananas", "author": 1, "featured_image": "image/upload/v1712754177/fip3usedsvobumru5ikr.jpg", "content": "<p>&nbsp;Grapefruit with Fried Bananas:</p>\r\n\r\n<p>Ingredients:<br />\r\n- 2 grapefruits<br />\r\n- 2 ripe bananas<br />\r\n- 1 tablespoon coconut oil<br />\r\n- 1-2 tablespoons maple syrup (optional)<br />\r\n- Pinch of ground cinnamon (optional)<br />\r\n- Pinch of salt<br />\r\n- Chopped nuts (such as walnuts or almonds) for garnish (optional)</p>\r\n\r\n<p>Instructions:<br />\r\n1. Peel the grapefruits and cut them into slices or segments. Arrange them on a serving plate and set aside.</p>\r\n\r\n<p>2. Peel the bananas and slice them into rounds.</p>\r\n\r\n<p>3. Heat the coconut oil in a non-stick skillet over medium heat.</p>\r\n\r\n<p>4. Once the oil is hot, add the banana slices to the skillet in a single layer. Fry the bananas for 2-3 minutes on each side, or until they are golden brown and caramelized.</p>\r\n\r\n<p>5. If desired, drizzle the maple syrup over the bananas in the skillet and sprinkle with a pinch of ground cinnamon. Allow the syrup to caramelize with the bananas for an additional minute.</p>\r\n\r\n<p>6. Using a spatula, carefully transfer the fried bananas to the serving plate with the grapefruit slices.</p>\r\n\r\n<p>7. Sprinkle a pinch of salt over the grapefruit and bananas.</p>\r\n\r\n<p>8. Optional: Garnish with chopped nuts, such as walnuts or almonds, for added texture and flavor.</p>\r\n\r\n<p>9. Serve the Grapefruit with Fried Bananas immediately as a delicious and refreshing vegan breakfast or dessert.</p>\r\n\r\n<p>Enjoy your Grapefruit with Fried Bananas!</p>", "created_on": "2024-04-10T13:02:58.337Z", "status": 1, "excerpt": "Experience the refreshing tang of grapefruit paired with the caramelized sweetness of fried bananas in this irresistible vegan delight.", "updated_on": "2024-04-10T13:02:58.337Z", "category": 4, "likes": []}}, {"model": "blog.post", "pk": 22, "fields": {"title": "Oat breakfast: porridge and waffles", "slug": "oat-based-breakfast-porridge-and-waffles", "author": 1, "featured_image": "image/upload/v1712754375/w2s9n8xtjnfq5me3j3ww.jpg", "content": "<p><strong>Oatmeal Porridge:</strong></p>\r\n\r\n<p>Ingredients:<br />\r\n- 1 cup rolled oats<br />\r\n- 2 cups water or milk of choice (e.g., almond milk, oat milk)<br />\r\n- Pinch of salt<br />\r\n- Toppings: sliced kiwi, blueberries, strawberries, maple syrup, nuts, seeds, or any desired toppings</p>\r\n\r\n<p>Instructions:<br />\r\n1. In a saucepan, bring the water or milk to a gentle boil.<br />\r\n2. Stir in the rolled oats and a pinch of salt.<br />\r\n3. Reduce the heat to low and simmer for about 5-7 minutes, stirring occasionally, until the oats are creamy and thickened.<br />\r\n4. Remove from heat and let it sit for a minute to cool slightly.<br />\r\n5. Serve the oatmeal in bowls and top with sliced kiwi, blueberries, strawberries, maple syrup, nuts, seeds, or any desired toppings.</p>\r\n\r\n<p><strong>Oat Waffles:</strong></p>\r\n\r\n<p>Ingredients:<br />\r\n- 1 1/2 cups oat flour (blend rolled oats in a food processor to make oat flour)<br />\r\n- 1 tablespoon baking powder<br />\r\n- 1/4 teaspoon salt<br />\r\n- 1 tablespoon maple syrup or sweetener of choice<br />\r\n- 1 cup non-dairy milk (e.g., almond milk, oat milk)<br />\r\n- 2 tablespoons melted coconut oil or oil of choice<br />\r\n- Toppings: sliced kiwi, blueberries, strawberries, maple syrup, nuts, seeds, or any desired toppings</p>\r\n\r\n<p>Instructions:<br />\r\n1. Preheat your waffle iron according to manufacturer instructions.<br />\r\n2. In a mixing bowl, whisk together the oat flour, baking powder, and salt.<br />\r\n3. Add the maple syrup, non-dairy milk, and melted coconut oil to the dry ingredients. Stir until well combined.<br />\r\n4. Once the waffle iron is heated, lightly grease it with oil or cooking spray.<br />\r\n5. Pour the batter onto the waffle iron, spreading it evenly.<br />\r\n6. Close the waffle iron and cook until the waffles are golden brown and crisp.<br />\r\n7. Remove the waffles from the iron and serve immediately.<br />\r\n8. Top the oat waffles with sliced kiwi, blueberries, strawberries, maple syrup, nuts, seeds, or any desired toppings.</p>\r\n\r\n<p>Enjoy your hearty and nutritious breakfast featuring oatmeal porridge and oat waffles with a colorful array of fresh fruits!</p>", "created_on": "2024-04-10T13:06:16.424Z", "status": 1, "excerpt": "Start your day with a hearty breakfast of oatmeal porridge and crispy oat waffles, topped with a vibrant mix of fresh kiwi, blueberries, and strawberries. Energize your morning with wholesome flavors and nutritious goodness.", "updated_on": "2024-04-10T13:06:34.097Z", "category": 1, "likes": []}}, {"model": "blog.post", "pk": 23, "fields": {"title": "Rainbow salad", "slug": "rainbow-salad", "author": 1, "featured_image": "image/upload/v1712759700/sypjldhi7ktp32q32auj.jpg", "content": "<p><strong>Ingredients:</strong><br />\r\n- 1 large tomato, diced<br />\r\n- 1 cup purple cabbage, shredded<br />\r\n- 1 ripe avocado, diced<br />\r\n- 1 large carrot, julienned<br />\r\n- 2 stalks celery, sliced<br />\r\n- 1 red bell pepper, thinly sliced<br />\r\n- 1 orange bell pepper, thinly sliced<br />\r\n- 4-5 radishes, thinly sliced<br />\r\n- 1 cup broccoli florets, chopped<br />\r\n- 1/4 cup fresh parsley, chopped<br />\r\n- 2 cups fresh baby spinach<br />\r\n- 1 cup raddichio leaves, torn<br />\r\n- 1 small beetroot, grated<br />\r\n- 1 cup arugula (ruccola)</p>\r\n\r\n<p><strong>Dressing</strong>:<br />\r\n- 1/4 cup olive oil<br />\r\n- 2 tablespoons balsamic vinegar<br />\r\n- 1 tablespoon lemon juice<br />\r\n- 1 teaspoon honey or maple syrup<br />\r\n- Salt and pepper to taste</p>\r\n\r\n<p><strong>Instructions</strong>:<br />\r\n1. In a large mixing bowl, combine all the prepared vegetables: diced tomato, shredded purple cabbage, diced avocado, julienned carrot, sliced celery, thinly sliced red and orange bell peppers, sliced radishes, chopped broccoli florets, chopped parsley, torn raddichio leaves, grated beetroot, and arugula.<br />\r\n2. In a small jar, combine the olive oil, balsamic vinegar, lemon juice, honey or maple syrup, salt, and pepper. Shake well to emulsify the dressing.<br />\r\n3. Pour the dressing over the salad and toss gently to coat all the vegetables evenly.<br />\r\n4. Serve immediately as a colorful and nutritious side dish or light lunch.</p>\r\n\r\n<p><strong>Notes</strong>:<br />\r\n- Feel free to substitute any of the vegetables with other seasonal options based on availability and personal preference. Different colored vegetables offer a variety of vitamins and minerals, so incorporating a range of colors not only adds visual appeal but also enhances the nutritional value of the salad.<br />\r\n- Encourage creativity by experimenting with different combinations of vegetables to create your own vibrant rainbow salad variations.</p>", "created_on": "2024-04-10T13:20:06.381Z", "status": 1, "excerpt": "Indulge in a vibrant Rainbow Salad bursting with colorful vegetables like tomato, avocado, bell peppers, and more. Substitute with seasonal veggies for a personalized twist, each hue offering a unique array of vitamins and minerals.", "updated_on": "2024-04-11T08:21:15.249Z", "category": 2, "likes": []}}, {"model": "blog.post", "pk": 25, "fields": {"title": "Breakfast Go-To Smoothie Bowl", "slug": "breakfast-go-to-smoothie-bowl", "author": 1, "featured_image": "image/upload/v1712759520/rgbzjlf37qq0kvv1gmj7.jpg", "content": "<p><strong>Vegan Banana Berry Smoothie Bowl Recipe</strong></p>\r\n\r\n<p><strong>Ingredients</strong>:<br />\r\n- 2 ripe bananas, frozen<br />\r\n- 1 cup mixed berries (such as strawberries, blueberries, raspberries)<br />\r\n- 1/2 cup plant-based milk (almond milk, coconut milk, etc.)<br />\r\n- 1 tablespoon chia seeds<br />\r\n- 2 tablespoons rolled oats<br />\r\n- 1 tablespoon maple syrup or agave syrup (optional, for added sweetness)<br />\r\n- Toppings: sliced bananas, fresh berries, granola, shredded coconut, chia seeds, nuts, seeds, etc.</p>\r\n\r\n<p><strong>Instructions</strong>:<br />\r\n1. **Prepare Ingredients**: Peel and slice the ripe bananas, then freeze them in advance. Rinse the mixed berries if using fresh ones.<br />\r\n&nbsp; &nbsp;<br />\r\n2. **Blend Smoothie Base**: In a blender, combine the frozen bananas, mixed berries, plant-based milk, chia seeds, rolled oats, and maple syrup (if using). Blend until smooth and creamy, adding more milk if needed to reach your desired consistency.</p>\r\n\r\n<p>3. **Assemble Smoothie Bowl**: Pour the blended smoothie into a bowl.</p>\r\n\r\n<p>4. **Add Toppings**: Arrange your desired toppings on top of the smoothie bowl. Get creative with a variety of toppings such as sliced bananas, fresh berries, granola, shredded coconut, chia seeds, nuts, and seeds.</p>\r\n\r\n<p>5. **Serve**: Enjoy your vibrant and nutritious vegan banana berry smoothie bowl immediately with a spoon!</p>\r\n\r\n<p>**Tips:**<br />\r\n- For extra creaminess, you can add a scoop of plant-based yogurt or avocado to the smoothie base.<br />\r\n- Customize your smoothie bowl with your favorite toppings for added flavor and texture.<br />\r\n- Feel free to experiment with different combinations of fruits and superfoods to suit your taste preferences and nutritional needs.<br />\r\n- Adjust the sweetness of the smoothie by adding more or less maple syrup or agave syrup according to your preference.<br />\r\n- Serve your smoothie bowl immediately after preparing to enjoy it at its freshest and creamiest state.</p>", "created_on": "2024-04-10T13:32:45.496Z", "status": 1, "excerpt": "Indulge in a creamy vegan delight with our Banana Berry Smoothie Bowl, bursting with the goodness of frozen bananas, mixed berries, and nutritious toppings. Customize with your favorite fruits and superfoods for a vibrant and satisfying breakfast or snack.", "updated_on": "2024-04-10T14:32:01.370Z", "category": 1, "likes": []}}, {"model": "blog.post", "pk": 26, "fields": {"title": "Homemade falafel", "slug": "homemade-falafel", "author": 1, "featured_image": "image/upload/v1712760830/wksdhblacojrzwe5tqay.jpg", "content": "<p>Sure! Here&#39;s a recipe for homemade falafel:</p>\r\n\r\n<p>**Homemade Falafel**</p>\r\n\r\n<p>**Ingredients:**<br />\r\n- 1 cup dried chickpeas<br />\r\n- 1/2 large onion, roughly chopped (about 1 cup)<br />\r\n- 2 cloves garlic, chopped<br />\r\n- 3 tablespoons fresh parsley, chopped<br />\r\n- 3 tablespoons fresh cilantro, chopped<br />\r\n- 1 teaspoon ground cumin<br />\r\n- 1 teaspoon ground coriander<br />\r\n- 1/4 teaspoon cayenne pepper<br />\r\n- Salt and pepper to taste<br />\r\n- 1 tablespoon lemon juice<br />\r\n- 1 teaspoon baking powder<br />\r\n- 4-6 tablespoons all-purpose flour or chickpea flour<br />\r\n- Oil for frying</p>\r\n\r\n<p>**Instructions:**</p>\r\n\r\n<p>1. **Prepare the Chickpeas:**<br />\r\n&nbsp; &nbsp;- Place the dried chickpeas in a large bowl and cover with cold water. Let them soak overnight. The chickpeas will double in size, so make sure there&#39;s enough water to cover them.<br />\r\n&nbsp; &nbsp;- After soaking, drain and rinse the chickpeas thoroughly.</p>\r\n\r\n<p>2. **Blend the Ingredients:**<br />\r\n&nbsp; &nbsp;- In a food processor, combine the soaked and drained chickpeas, onion, garlic, parsley, cilantro, cumin, coriander, cayenne pepper, salt, pepper, and lemon juice.<br />\r\n&nbsp; &nbsp;- Pulse the mixture until everything is finely minced and holds together when pinched. You may need to scrape down the sides of the processor occasionally.</p>\r\n\r\n<p>3. **Add Binding Agents:**<br />\r\n&nbsp; &nbsp;- Sprinkle baking powder and 4 tablespoons of flour over the mixture in the food processor.<br />\r\n&nbsp; &nbsp;- Pulse a few more times to combine. Check the consistency of the mixture; it should hold together when squeezed. If it&#39;s too wet, add more flour, 1 tablespoon at a time, until you can form a ball that stays together.</p>\r\n\r\n<p>4. **Shape the Falafel:**<br />\r\n&nbsp; &nbsp;- Transfer the mixture to a bowl and cover it. Let it rest in the refrigerator for at least 1 hour. This helps the flavors meld and makes the mixture easier to work with.<br />\r\n&nbsp; &nbsp;- After chilling, shape the falafel mixture into small balls, about 1 1/2 inches in diameter. You can use your hands or a falafel scoop to form them.</p>\r\n\r\n<p>5. **Fry the Falafel:**<br />\r\n&nbsp; &nbsp;- In a deep skillet or pot, heat about 2 inches of oil over medium-high heat until it reaches 350&deg;F (175&deg;C).<br />\r\n&nbsp; &nbsp;- Carefully add the falafel balls to the hot oil, a few at a time, making sure not to overcrowd the pan. Fry until they are deep golden brown and crispy, about 3-4 minutes per side.<br />\r\n&nbsp; &nbsp;- Use a slotted spoon to transfer the cooked falafel to a plate lined with paper towels to drain excess oil.</p>\r\n\r\n<p>6. **Serve:**<br />\r\n&nbsp; &nbsp;- Serve the falafel hot with pita bread, hummus, tahini sauce, chopped tomatoes, cucumbers, lettuce, and any other toppings you like.<br />\r\n&nbsp; &nbsp;- Enjoy your delicious homemade falafel!</p>\r\n\r\n<p>**Note:** You can also bake the falafel for a healthier option. Preheat your oven to 375&deg;F (190&deg;C), place the shaped falafel on a lightly greased baking sheet, and bake for 20-25 minutes, flipping halfway through, until they are golden brown and crispy.</p>", "created_on": "2024-04-10T14:53:51.325Z", "status": 1, "excerpt": "Delight in homemade falafel, a medley of chickpeas and fragrant spices, fried to crispy perfection and served with creamy hummus and fresh pita. Enjoy the savory crunch of each bite, bursting with Middle Eastern flavors and wholesome goodness.", "updated_on": "2024-04-10T14:53:51.325Z", "category": 3, "likes": []}}, {"model": "blog.post", "pk": 27, "fields": {"title": "Beetroot soup with vegan feta", "slug": "beetroot-soup-with-vegan-feta", "author": 1, "featured_image": "image/upload/v1712761060/ksuacff3aavjyfaujupo.jpg", "content": "<p><strong>Ingredients:</strong></p>\r\n\r\n<ul>\r\n\t<li>4 medium-sized beetroots, peeled and diced</li>\r\n\t<li>1 onion, chopped</li>\r\n\t<li>2 cloves garlic, minced</li>\r\n\t<li>4 cups vegetable broth</li>\r\n\t<li>1 tablespoon olive oil</li>\r\n\t<li>Salt and pepper to taste</li>\r\n\t<li>4 slices of bread (use gluten-free bread if needed)</li>\r\n\t<li>Vegan feta cheese, crumbled</li>\r\n\t<li>Fresh parsley for garnish</li>\r\n</ul>\r\n\r\n<p><strong>Instructions:</strong></p>\r\n\r\n<ol>\r\n\t<li>Heat olive oil in a large pot over medium heat. Add chopped onions and minced garlic, saut&eacute; until softened.</li>\r\n\t<li>Add diced beetroots to the pot and cook for about 5 minutes, stirring occasionally.</li>\r\n\t<li>Pour vegetable broth into the pot and bring to a boil. Once boiling, reduce heat to low and simmer for 20-25 minutes or until the beetroots are tender.</li>\r\n\t<li>Using an immersion blender or regular blender, puree the soup until smooth. Season with salt and pepper according to taste.</li>\r\n\t<li>While the soup is simmering, toast the bread slices until golden brown.</li>\r\n\t<li>Ladle the beetroot soup into serving bowls. Top each bowl with a slice of toasted bread and crumbled vegan feta cheese.</li>\r\n\t<li>Garnish with fresh parsley and serve hot.</li>\r\n</ol>\r\n\r\n<p>Enjoy the rich flavors and vibrant colors of this comforting beetroot soup, complemented by the creamy texture of vegan feta cheese and crispy toast.</p>", "created_on": "2024-04-10T14:57:41.409Z", "status": 1, "excerpt": "Indulge in the velvety richness of homemade beetroot soup, adorned with crispy toast and tantalizing vegan feta cheese crumbles—an exquisite blend of flavors to warm your soul and invigorate your palate.", "updated_on": "2024-04-10T16:18:30.541Z", "category": 2, "likes": []}}, {"model": "blog.post", "pk": 28, "fields": {"title": "Spirulina smoothie bowl", "slug": "spirulina-smoothie-bowl", "author": 1, "featured_image": "image/upload/v1712761202/m7wqwfkgy1nrsnujqpsh.jpg", "content": "<p><strong>Recipe: Plant-Based Spirulina Smoothie Bowl</strong></p>\r\n\r\n<p><strong>Ingredients:</strong><br />\r\n- 1 ripe banana, frozen<br />\r\n- 1/2 cup frozen mixed berries (such as strawberries, blueberries, raspberries)<br />\r\n- 1 tablespoon spirulina powder<br />\r\n- 1/2 cup spinach leaves<br />\r\n- 1/2 cup plant-based milk (such as almond milk or coconut milk)<br />\r\n- Toppings: sliced fresh fruit (such as kiwi, strawberries, and banana), granola, shredded coconut, chia seeds, hemp seeds, and sliced almonds</p>\r\n\r\n<p><strong>Instructions</strong>:<br />\r\n1. In a blender, combine the frozen banana, frozen mixed berries, spirulina powder, spinach leaves, and plant-based milk.<br />\r\n2. Blend on high until smooth and creamy, adding more plant-based milk if needed to reach your desired consistency.<br />\r\n3. Pour the smoothie into a bowl.<br />\r\n4. Arrange the sliced fresh fruit, granola, shredded coconut, chia seeds, hemp seeds, and sliced almonds on top of the smoothie.<br />\r\n5. Serve immediately and enjoy!</p>\r\n\r\n<p>&nbsp;</p>", "created_on": "2024-04-10T15:00:02.955Z", "status": 1, "excerpt": "Dive into a vibrant bowl of plant-powered goodness with our Spirulina Smoothie Bowl. Bursting with the nourishing goodness of ripe banana, mixed berries, and the superfood spirulina, this vibrant concoction is topped with an array of fresh fruits, crunchy granola, and wholesome seeds. Energize your day with this nutrient-packed delight!", "updated_on": "2024-04-10T15:00:02.955Z", "category": 1, "likes": []}}, {"model": "blog.post", "pk": 29, "fields": {"title": "Hummus and avocado toast", "slug": "hummus-and-avocado-toast", "author": 1, "featured_image": "image/upload/v1712761564/r6qruwfv0xtizsyhqqoi.jpg", "content": "<p><strong>Recipe: Hummus Avocado Toast</strong></p>\r\n\r\n<p><strong>Ingredients</strong>:<br />\r\n- 2 slices whole grain bread<br />\r\n- 1 ripe avocado<br />\r\n- 1/2 lemon<br />\r\n- Salt and pepper to taste<br />\r\n- 1/2 cup hummus<br />\r\n- Optional toppings: cherry tomatoes, red pepper flakes, sesame seeds, cilantro</p>\r\n\r\n<p><strong>Instructions</strong>:<br />\r\n1. Toast the slices of whole grain bread until golden brown and crispy.<br />\r\n2. Mash the ripe avocado in a bowl with the juice of half a lemon, salt, and pepper to taste.<br />\r\n3. Spread a generous layer of hummus onto each slice of toast.<br />\r\n4. Top the hummus with the mashed avocado mixture.<br />\r\n5. Garnish with your favorite toppings such as cherry tomatoes, red pepper flakes, sesame seeds, or fresh cilantro.<br />\r\n6. Serve immediately and enjoy this delicious and nutritious hummus avocado toast!</p>\r\n\r\n<p><br />\r\nElevate your breakfast or snack time with our Hummus Avocado Toast. Crispy whole grain bread slathered with creamy hummus and topped with mashed avocado, this simple yet satisfying dish is bursting with flavor and nutrients. Indulge in a bite of wholesome goodness to fuel your day!</p>", "created_on": "2024-04-10T15:06:05.249Z", "status": 1, "excerpt": "Elevate your breakfast or snack time with our Hummus Avocado Toast. Crispy whole grain bread slathered with creamy hummus and topped with mashed avocado, this simple yet satisfying dish is bursting with flavor and nutrients. Indulge in a bite of wholesome goodness to fuel your day!", "updated_on": "2024-04-10T15:06:05.249Z", "category": 4, "likes": []}}, {"model": "blog.post", "pk": 30, "fields": {"title": "Vegan onion soup", "slug": "vegan-onion-soup", "author": 1, "featured_image": "image/upload/v1712763510/d9vd19vdsxmz54x7wtgt.jpg", "content": "<p><strong>Ingredients</strong>:<br />\r\n- 4 large onions, thinly sliced<br />\r\n- 2 tablespoons olive oil<br />\r\n- 4 cloves garlic, minced<br />\r\n- 6 cups vegetable broth<br />\r\n- 1 teaspoon dried thyme<br />\r\n- Salt and pepper to taste<br />\r\n- Baguette slices, for serving<br />\r\n- Store-bought vegan cheese, for topping<br />\r\n- Fresh parsley, chopped, for garnish (optional)</p>\r\n\r\n<p><strong>Instructions</strong>:<br />\r\n1. Heat olive oil in a large pot over medium heat. Add the sliced onions and cook, stirring occasionally, until caramelized and golden brown, about 25-30 minutes.<br />\r\n2. Add minced garlic to the pot and cook for an additional 2 minutes until fragrant.<br />\r\n3. Pour in the vegetable broth and dried thyme. Season with salt and pepper to taste. Bring the soup to a simmer and let it cook for another 15-20 minutes to allow the flavors to meld.<br />\r\n4. Preheat the broiler. Ladle the soup into oven-safe bowls. Top each bowl with a slice of baguette and sprinkle store-bought vegan cheese over the bread.<br />\r\n5. Place the bowls under the broiler for 2-3 minutes, or until the cheese is melted and bubbly.<br />\r\n6. Garnish with fresh chopped parsley if desired. Serve hot and enjoy this comforting vegan onion soup with crusty bread and gooey vegan cheese!</p>\r\n\r\n<p>&nbsp;</p>", "created_on": "2024-04-10T15:08:12.478Z", "status": 1, "excerpt": "Warm up with our hearty Vegan Onion Soup, a soul-soothing dish that combines caramelized onions, savory broth, and gooey vegan cheese. Topped with crusty bread and melted cheese, it's a delightful twist on a classic favorite, perfect for cozy evenings or anytime you crave comfort in a bowl.", "updated_on": "2024-04-10T16:18:09.459Z", "category": 2, "likes": []}}, {"model": "blog.post", "pk": 31, "fields": {"title": "Orange Glazed Tofu Bowl", "slug": "orange-glazed-tofu-bowl", "author": 1, "featured_image": "image/upload/v1712763796/va2l2sndj7hj8qexvnye.jpg", "content": "<p><strong>Ingredients</strong>:<br />\r\n- 1 block firm tofu, pressed and cut into cubes<br />\r\n- 1/4 cup orange juice<br />\r\n- 2 tablespoons soy sauce<br />\r\n- 2 tablespoons maple syrup<br />\r\n- 1 tablespoon rice vinegar<br />\r\n- 1 teaspoon sesame oil<br />\r\n- 2 cloves garlic, minced<br />\r\n- 1 teaspoon grated ginger<br />\r\n- 1 tablespoon cornstarch<br />\r\n- 1 tablespoon water<br />\r\n- Cooked rice, for serving<br />\r\n- Haricots verts (French green beans), steamed, for serving<br />\r\n- Sesame seeds, for garnish</p>\r\n\r\n<p><strong>Instructions</strong>:<br />\r\n1. In a bowl, whisk together orange juice, soy sauce, maple syrup, rice vinegar, sesame oil, minced garlic, and grated ginger to make the glaze.<br />\r\n2. In a separate small bowl, mix cornstarch and water to create a slurry. Set aside.<br />\r\n3. Heat a non-stick skillet over medium-high heat. Add tofu cubes and cook until golden brown and crispy on all sides.<br />\r\n4. Reduce heat to medium-low, pour the orange glaze over the tofu, and stir to coat evenly. Allow the glaze to thicken for a few minutes.<br />\r\n5. Once the glaze has thickened and coated the tofu well, remove from heat.<br />\r\n6. Serve the sticky orange glazed tofu over cooked rice and steamed haricots verts. Garnish with sesame seeds.<br />\r\n7. Enjoy this delicious and flavorful tofu dish with a perfect balance of sweet, tangy, and savory flavors!</p>\r\n\r\n<p>&nbsp;</p>", "created_on": "2024-04-10T15:13:16.478Z", "status": 1, "excerpt": "Indulge in our Sticky Orange Glaze Tofu, a tantalizing fusion of sweet citrus flavors and savory tofu, served with tender haricots verts and fluffy rice. Bursting with vibrant colors and delightful textures, it's a delectable plant-based meal that's sure to satisfy your cravings.", "updated_on": "2024-04-10T16:17:44.275Z", "category": 3, "likes": []}}, {"model": "blog.post", "pk": 32, "fields": {"title": "Vegan Burger", "slug": "vegan-burger", "author": 1, "featured_image": "image/upload/v1712762243/alok7bsqhrkq4hebshvq.jpg", "content": "<p><strong>Ingredients</strong>:<br />\r\n- vegan burger patties&nbsp;<br />\r\n- vegan burger buns<br />\r\n- vegan cheese<br />\r\n- Lettuce leaves<br />\r\n- Sliced tomatoes<br />\r\n- Sliced red onion<br />\r\n- Pickles<br />\r\n- Vegan mayonnaise<br />\r\n- Mustard<br />\r\n- Ketchup</p>\r\n\r\n<p><strong>Instructions</strong>:<br />\r\n1. Heat a grill or non-stick skillet over medium heat. Cook the vegan burger patties according to package instructions until heated through and slightly crispy on the outside.<br />\r\n2. Toast the burger buns lightly on the grill or in a toaster.<br />\r\n3. Assemble the burgers: Spread vegan mayonnaise on the bottom half of each bun, followed by mustard and ketchup to taste.<br />\r\n4. Place a lettuce leaf on each bun, followed by a slice of tomato and red onion.<br />\r\n5. Place a cooked vegan burger patty on top of the veggies, then add a slice of vegan cheese.<br />\r\n6. Top with pickles and the other half of the bun.<br />\r\n7. Serve your delicious vegan burgers with your favorite sides and enjoy!</p>\r\n\r\n<p>&nbsp;</p>", "created_on": "2024-04-10T15:17:23.892Z", "status": 1, "excerpt": "Savor the convenience and flavor of our Vegan Burger with Store-Bought Patty and Cheese – a quick and satisfying plant-based meal that promises bold flavors and hearty satisfaction in every bite.", "updated_on": "2024-04-10T15:18:00.277Z", "category": 3, "likes": [2]}}, {"model": "blog.post", "pk": 33, "fields": {"title": "Vegan Coconut Yogurt Breakfast Bowl", "slug": "vegan-coconut-yogurt-breakfast-bowl", "author": 1, "featured_image": "image/upload/v1712762498/ku1e7e59h95h4w5teswl.jpg", "content": "<p><strong>Ingredients</strong>:<br />\r\n- 1 cup coconut yogurt<br />\r\n- Assorted berries (strawberries, blueberries, raspberries)<br />\r\n- Sliced fruits (banana, kiwi, mango, etc.)<br />\r\n- 2 tablespoons chia seeds<br />\r\n- Drizzle of maple syrup or agave syrup (optional)<br />\r\n- Granola or nuts (optional, for added crunch)</p>\r\n\r\n<p><strong>Instructions</strong>:<br />\r\n1. In a bowl, spoon out the coconut yogurt as the base.<br />\r\n2. Arrange the assorted berries and sliced fruits on top of the yogurt.<br />\r\n3. Sprinkle chia seeds evenly over the fruits.<br />\r\n4. Drizzle with maple syrup or agave syrup for sweetness, if desired.<br />\r\n5. Optionally, top with granola or nuts for added texture and flavor.<br />\r\n6. Serve chilled and enjoy this refreshing and nutritious vegan breakfast bowl!</p>\r\n\r\n<p>&nbsp;</p>", "created_on": "2024-04-10T15:21:39.550Z", "status": 1, "excerpt": "Indulge in a delightful morning treat with our Vegan Coconut Yogurt Breakfast Bowl, bursting with the vibrant colors and flavors of fresh fruits, nutrient-rich chia seeds, and creamy coconut yogurt, promising a nourishing start to your day.", "updated_on": "2024-04-10T15:21:39.550Z", "category": 1, "likes": []}}, {"model": "blog.post", "pk": 34, "fields": {"title": "Baked Tempeh Skewers with Peanut Sauce", "slug": "baked-tempeh-skewers-with-peanut-sauce", "author": 1, "featured_image": "image/upload/v1712763775/wdj8kt1d7tp2jh7kjsyr.jpg", "content": "<p><strong>Ingredients</strong>:<br />\r\n- 1 block tempeh, cut into cubes<br />\r\n- Wooden skewers, soaked in water for 30 minutes<br />\r\n- 2 tablespoons soy sauce<br />\r\n- 1 tablespoon maple syrup<br />\r\n- 1 tablespoon lime juice<br />\r\n- 1 teaspoon minced garlic<br />\r\n- 1/2 teaspoon ground ginger<br />\r\n- For Peanut Sauce:<br />\r\n&nbsp; - 1/4 cup peanut butter<br />\r\n&nbsp; - 2 tablespoons soy sauce<br />\r\n&nbsp; - 1 tablespoon maple syrup<br />\r\n&nbsp; - 1 tablespoon lime juice<br />\r\n&nbsp; - 1 teaspoon sriracha sauce (optional)<br />\r\n&nbsp; - Water, as needed to thin</p>\r\n\r\n<p><strong>Instructions</strong>:<br />\r\n1. Preheat the oven to 375&deg;F (190&deg;C).&nbsp;<br />\r\n2. In a bowl, mix soy sauce, maple syrup, lime juice, minced garlic, and ground ginger.<br />\r\n3. Thread the tempeh cubes onto the skewers and place them in a baking dish.<br />\r\n4. Brush the tempeh skewers with the marinade mixture.<br />\r\n5. Bake in the preheated oven for 20-25 minutes, turning halfway through.<br />\r\n6. While baking, prepare the peanut sauce by whisking together peanut butter, soy sauce, maple syrup, lime juice, and sriracha sauce. Add water as needed to achieve desired consistency.<br />\r\n7. Once the tempeh skewers are cooked through and golden brown, remove them from the oven.<br />\r\n8. Serve the baked tempeh skewers with peanut sauce on the side for dipping.</p>\r\n\r\n<p>&nbsp;</p>", "created_on": "2024-04-10T15:25:14.549Z", "status": 1, "excerpt": "Savor the savory delight of our Baked Tempeh Skewers with luscious Peanut Sauce, offering a harmony of flavors and textures that will tantalize your taste buds with every bite, making it a delightful addition to any meal or gathering.", "updated_on": "2024-04-11T09:38:11.252Z", "category": 4, "likes": [3]}}, {"model": "blog.post", "pk": 35, "fields": {"title": "Protein-Packed Quinoa Bowl", "slug": "protein-packed-quinoa-bowl", "author": 1, "featured_image": "image/upload/v1712763758/pqempvzmmdi7mjyq8pom.jpg", "content": "<p><strong>Ingredients</strong>:<br />\r\n- 1 cup quinoa, cooked<br />\r\n- 1 ripe avocado, sliced<br />\r\n- 1 nectarine, diced<br />\r\n- 2 cups kale, chopped<br />\r\n- 1 cup cooked chickpeas<br />\r\n- 1/4 cup red onion, thinly sliced<br />\r\n- 1/4 cup pistachio nuts, chopped<br />\r\n- 1/2 cup edamame, cooked<br />\r\n- For dressing:<br />\r\n&nbsp; - 2 tablespoons olive oil<br />\r\n&nbsp; - 1 tablespoon lemon juice<br />\r\n&nbsp; - 1 teaspoon honey or maple syrup<br />\r\n&nbsp; - Salt and pepper to taste</p>\r\n\r\n<p><strong>Instructions</strong>:<br />\r\n1. In a large bowl, combine cooked quinoa, avocado slices, diced nectarine, chopped kale, cooked chickpeas, sliced red onion, chopped pistachio nuts, and cooked edamame.<br />\r\n2. In a small bowl, whisk together olive oil, lemon juice, honey or maple syrup, salt, and pepper to make the dressing.<br />\r\n3. Drizzle the dressing over the quinoa bowl and toss gently to coat all ingredients evenly.<br />\r\n4. Divide the quinoa mixture into serving bowls and serve immediately.</p>\r\n\r\n<p>&nbsp;</p>", "created_on": "2024-04-10T15:30:14.034Z", "status": 1, "excerpt": "Indulge in the wholesome goodness of our Protein-Packed Quinoa Bowl, brimming with nutritious quinoa, vibrant fruits and vegetables, and protein-rich chickpeas and edamame, offering a flavorful and satisfying meal that nourishes both body and soul.", "updated_on": "2024-04-10T16:17:19.651Z", "category": 3, "likes": []}}, {"model": "blog.post", "pk": 36, "fields": {"title": "Fluffy Vegan Pancakes", "slug": "fluffy-vegan-pancakes", "author": 1, "featured_image": "image/upload/v1712763212/ekpchyimkth6ejy253yi.jpg", "content": "<p><strong>Ingredients</strong>:<br />\r\n- 1 cup all-purpose flour<br />\r\n- 1 tablespoon sugar<br />\r\n- 2 teaspoons baking powder<br />\r\n- 1/4 teaspoon salt<br />\r\n- 1 cup non-dairy milk (such as almond or soy milk)<br />\r\n- 2 tablespoons vegetable oil<br />\r\n- 1 teaspoon vanilla extract<br />\r\n- For serving:<br />\r\n&nbsp; - Fresh blueberries<br />\r\n&nbsp; - Maple syrup<br />\r\n&nbsp; - Hemp seeds</p>\r\n\r\n<p><strong>Instructions</strong>:<br />\r\n1. In a large mixing bowl, whisk together the flour, sugar, baking powder, and salt.<br />\r\n2. Add the non-dairy milk, vegetable oil, and vanilla extract to the dry ingredients. Stir until just combined. Do not overmix; lumps are okay.<br />\r\n3. Heat a non-stick skillet or griddle over medium heat. Once hot, pour 1/4 cup of batter onto the skillet for each pancake.<br />\r\n4. Cook until bubbles form on the surface of the pancakes and the edges begin to look set, about 2-3 minutes. Flip and cook for an additional 1-2 minutes until golden brown on both sides.<br />\r\n5. Serve the pancakes warm, topped with fresh blueberries, drizzled with maple syrup, and sprinkled with hemp seeds.</p>\r\n\r\n<p>&nbsp;</p>", "created_on": "2024-04-10T15:33:33.420Z", "status": 1, "excerpt": "Elevate your breakfast game with our Fluffy Vegan Pancakes, delightfully light and airy, adorned with juicy blueberries, a drizzle of rich maple syrup, and a sprinkle of nutritious hemp seeds, promising a delectable morning treat that's both wholesome and indulgent.", "updated_on": "2024-04-10T15:33:33.421Z", "category": 1, "likes": []}}, {"model": "blog.post", "pk": 37, "fields": {"title": "Chocolate Chip Cookies with Sea Salt", "slug": "chocolate-chip-cookies-with-sea-salt", "author": 1, "featured_image": "image/upload/v1712763962/urzsfrfhkbrjlc2a9hmh.jpg", "content": "<p><strong>Ingredients</strong>:<br />\r\n- 2 cups all-purpose flour<br />\r\n- 1 teaspoon baking soda<br />\r\n- 1/2 teaspoon salt<br />\r\n- 1/2 cup coconut oil, melted<br />\r\n- 3/4 cup brown sugar<br />\r\n- 1/4 cup granulated sugar<br />\r\n- 1/4 cup unsweetened applesauce<br />\r\n- 1 teaspoon vanilla extract<br />\r\n- 1 cup vegan chocolate chips<br />\r\n- Sea salt flakes, for topping</p>\r\n\r\n<p><strong>Instructions</strong>:<br />\r\n1. Preheat your oven to 350&deg;F (175&deg;C) and line a baking sheet with parchment paper.<br />\r\n2. In a mixing bowl, whisk together the flour, baking soda, and salt.<br />\r\n3. In a separate bowl, mix together the melted coconut oil, brown sugar, granulated sugar, applesauce, and vanilla extract until well combined.<br />\r\n4. Gradually add the dry ingredients to the wet ingredients, stirring until a dough forms.<br />\r\n5. Fold in the vegan chocolate chips until evenly distributed throughout the dough.<br />\r\n6. Using a cookie scoop or spoon, drop tablespoon-sized portions of dough onto the prepared baking sheet, leaving space between each cookie.<br />\r\n7. Gently press down on each cookie with the back of a spoon to flatten slightly. Sprinkle a pinch of sea salt flakes on top of each cookie.<br />\r\n8. Bake in the preheated oven for 10-12 minutes, or until the edges are golden brown.<br />\r\n9. Allow the cookies to cool on the baking sheet for a few minutes before transferring them to a wire rack to cool completely.</p>\r\n\r\n<p>&nbsp;</p>", "created_on": "2024-04-10T15:46:03.107Z", "status": 1, "excerpt": "Indulge in the ultimate vegan delight with these Chocolate Chip Cookies, a symphony of rich cocoa flavors melded with the perfect balance of sweetness, finished with a delicate sprinkle of sea salt, promising a divine treat that's both irresistible and ethically conscious.", "updated_on": "2024-04-11T08:20:22.154Z", "category": 4, "likes": []}}, {"model": "blog.post", "pk": 38, "fields": {"title": "Superfood Smoothie Bowl", "slug": "superfood-smoothie-bowl", "author": 1, "featured_image": "image/upload/v1712765160/j7xfeazcd1oh6vembpyo.jpg", "content": "<p><strong>Ingredients</strong>:<br />\r\n- 1 ripe banana, frozen<br />\r\n- 1/2 cup frozen blueberries<br />\r\n- 1 cup fresh spinach leaves<br />\r\n- 1 teaspoon spirulina powder<br />\r\n- 1 teaspoon chlorella powder<br />\r\n- 1/2 cup plant-based milk (such as almond or coconut)<br />\r\n- Toppings: sliced fruit, granola, shredded coconut, chia seeds, additional blueberries</p>\r\n\r\n<p><strong>Instructions</strong>:<br />\r\n1. In a blender, combine the frozen banana, frozen blueberries, spinach leaves, spirulina powder, chlorella powder, and plant-based milk.<br />\r\n2. Blend until smooth and creamy, adding more milk if needed to reach your desired consistency.<br />\r\n3. Pour the smoothie into a bowl and top with your favorite toppings, such as sliced fruit, granola, shredded coconut, chia seeds, and additional blueberries.<br />\r\n4. Enjoy immediately with a spoon!</p>\r\n\r\n<p>&nbsp;</p>", "created_on": "2024-04-10T16:06:01.100Z", "status": 1, "excerpt": "Elevate your mornings with our vibrant Plant-Based Superfood Smoothie Bowl, bursting with the goodness of spirulina, chlorella, and nutrient-rich spinach, crowned with a colorful array of fresh fruit and blueberries, offering a nourishing and energizing start to your day.", "updated_on": "2024-04-10T16:06:01.100Z", "category": 1, "likes": []}}, {"model": "blog.post", "pk": 39, "fields": {"title": "Pizza with Black Olives and Vegan Sausage", "slug": "pizza-with-black-olives-and-vegan-sausage", "author": 1, "featured_image": "image/upload/v1712765368/twq6lkxlcgnhasmndezn.jpg", "content": "<p><strong>Ingredients for Pizza Dough:</strong><br />\r\n- 2 1/4 teaspoons (1 packet) active dry yeast<br />\r\n- 1 1/2 cups warm water<br />\r\n- 4 cups all-purpose flour<br />\r\n- 1 tablespoon sugar<br />\r\n- 2 tablespoons olive oil<br />\r\n- 1 teaspoon salt</p>\r\n\r\n<p><strong>Ingredients for Pizza Toppings</strong>:<br />\r\n- 1 cup tomato sauce<br />\r\n- Vegan cheese, shredded<br />\r\n- Black olives, sliced<br />\r\n- Vegan sausage, sliced</p>\r\n\r\n<p><strong>Instructions</strong>:<br />\r\n1. In a small bowl, combine the warm water and yeast. Let it sit for about 5 minutes until frothy.<br />\r\n2. In a large mixing bowl, combine the flour, sugar, olive oil, and salt. Pour in the yeast mixture and stir until a dough forms.<br />\r\n3. Knead the dough on a floured surface for about 5-7 minutes until smooth and elastic. Place the dough in a greased bowl, cover with a clean towel, and let it rise in a warm place for 1-2 hours until doubled in size.<br />\r\n4. Preheat your oven to 450&deg;F (230&deg;C). Punch down the dough and roll it out on a floured surface to your desired thickness.<br />\r\n5. Transfer the rolled-out dough to a baking sheet or pizza stone. Spread the tomato sauce evenly over the dough, leaving a small border around the edges.<br />\r\n6. Sprinkle the shredded vegan cheese over the sauce, then add the sliced black olives and vegan sausage.<br />\r\n7. Bake in the preheated oven for 15-20 minutes, or until the crust is golden brown and the toppings are bubbly and heated through.<br />\r\n8. Remove from the oven, slice, and serve hot.</p>\r\n\r\n<p>&nbsp;</p>", "created_on": "2024-04-10T16:09:29.276Z", "status": 1, "excerpt": "Indulge in the savory delight of this pizza, boasting a homemade crust perfectly topped with tangy tomato sauce, melty vegan cheese, briny black olives, and savory vegan sausage, delivering a plant-based twist on a classic favorite.", "updated_on": "2024-04-10T16:09:29.276Z", "category": 3, "likes": []}}, {"model": "blog.post", "pk": 40, "fields": {"title": "Refreshing Watermelon Lemon Thyme Juice", "slug": "refreshing-watermelon-lemon-thyme-juice", "author": 1, "featured_image": "image/upload/v1712765580/ixq6ef6teigfqumt22yr.jpg", "content": "<p><strong>Ingredients</strong>:&nbsp;<br />\r\n- 4 cups diced watermelon<br />\r\n- Juice of 2 lemons<br />\r\n- 1 tablespoon fresh thyme leaves<br />\r\n- Ice cubes (optional)</p>\r\n\r\n<p><strong>Instructions</strong>:<br />\r\n1. In a blender, combine the diced watermelon, lemon juice, and fresh thyme leaves.<br />\r\n2. Blend until smooth and well combined.<br />\r\n3. Strain the juice through a fine-mesh sieve to remove any pulp, if desired.<br />\r\n4. Serve the juice over ice cubes for an extra refreshing touch.<br />\r\n5. Garnish with a sprig of fresh thyme, if desired.</p>\r\n\r\n<p>&nbsp;</p>", "created_on": "2024-04-10T16:13:00.520Z", "status": 1, "excerpt": "Start your summer mornings with a burst of freshness with our Watermelon Lemon Thyme Juice. This invigorating blend of juicy watermelon, zesty lemon, and aromatic thyme is sure to awaken your senses and energize you for the day ahead.", "updated_on": "2024-04-10T16:13:00.520Z", "category": 1, "likes": []}}, {"model": "blog.post", "pk": 41, "fields": {"title": "Tofu and Rice Noodle Curry", "slug": "tofu-and-rice-noodle-curry", "author": 1, "featured_image": "image/upload/v1712765746/judcjerlre9qle5mdd7y.jpg", "content": "<p><strong>Ingredients</strong>:<br />\r\n- 200g firm tofu, diced<br />\r\n- 150g rice noodles, cooked according to package instructions<br />\r\n- 1 can (400ml) coconut milk<br />\r\n- 2 tablespoons red curry paste<br />\r\n- 1 red bell pepper, thinly sliced<br />\r\n- 1 onion, thinly sliced<br />\r\n- 2 cloves garlic, minced<br />\r\n- 1 tablespoon soy sauce<br />\r\n- 1 tablespoon maple syrup<br />\r\n- Juice of 1 lime<br />\r\n- Handful of fresh coriander leaves, chopped<br />\r\n- Salt and pepper to taste<br />\r\n- Vegetable oil for cooking</p>\r\n\r\n<p><strong>Instructions</strong>:<br />\r\n1. Heat a little vegetable oil in a large pan over medium heat. Add the diced tofu and fry until golden brown on all sides. Remove from the pan and set aside.<br />\r\n2. In the same pan, add a bit more oil if needed and saut&eacute; the onion and garlic until softened.<br />\r\n3. Stir in the red curry paste and cook for a minute until fragrant.<br />\r\n4. Add the sliced bell pepper and cooked rice noodles to the pan, followed by the coconut milk, soy sauce, and maple syrup. Stir well to combine.<br />\r\n5. Allow the curry to simmer for 5-7 minutes until the sauce thickens slightly and the vegetables are tender.<br />\r\n6. Return the fried tofu to the pan and stir in the lime juice. Season with salt and pepper to taste.<br />\r\n7. Serve the curry hot, garnished with chopped fresh coriander leaves.</p>\r\n\r\n<p>&nbsp;</p>", "created_on": "2024-04-10T16:15:47.089Z", "status": 1, "excerpt": "Indulge in the aromatic flavors of our Tofu and Rice Noodle Curry—a delightful fusion of creamy coconut milk, zesty lime, and fragrant coriander. This plant-based dish promises a culinary adventure with every bite.", "updated_on": "2024-04-10T16:17:00.509Z", "category": 3, "likes": []}}, {"model": "blog.post", "pk": 42, "fields": {"title": "Cocoa Pancakes with Strawberries and Edible Flowers", "slug": "cocoa-pancakes-with-strawberries-and-edible-flowers", "author": 1, "featured_image": "image/upload/v1712766136/pnicpm9cjptrh8blzopl.jpg", "content": "<p><strong>Ingredients</strong>:<br />\r\n- 1 cup all-purpose flour<br />\r\n- 2 tablespoons cocoa powder<br />\r\n- 2 tablespoons sugar<br />\r\n- 1 tablespoon baking powder<br />\r\n- 1 cup plant-based milk (such as almond or soy)<br />\r\n- 1 tablespoon apple cider vinegar<br />\r\n- 1 teaspoon vanilla extract<br />\r\n- Coconut oil for cooking<br />\r\n- Fresh strawberries, sliced<br />\r\n- Edible flowers for garnish</p>\r\n\r\n<p><strong>Instructions</strong>:<br />\r\n1. In a mixing bowl, combine the flour, cocoa powder, sugar, and baking powder.<br />\r\n2. In another bowl, mix the plant-based milk, apple cider vinegar, and vanilla extract.<br />\r\n3. Pour the wet ingredients into the dry ingredients and whisk until smooth.<br />\r\n4. Heat a non-stick pan over medium heat and lightly grease with coconut oil.<br />\r\n5. Pour a ladleful of batter onto the pan and cook until bubbles form on the surface.<br />\r\n6. Flip the pancake and cook until both sides are golden brown.<br />\r\n7. Repeat with the remaining batter.<br />\r\n8. Serve the pancakes topped with sliced strawberries and edible flowers.</p>\r\n\r\n<p>&nbsp;</p>", "created_on": "2024-04-10T16:22:17.322Z", "status": 1, "excerpt": "Savor the decadence of our Vegan Cocoa Pancakes adorned with vibrant strawberries and delicate edible flowers—a delightful symphony of flavors and colors that will brighten any morning.", "updated_on": "2024-04-10T16:22:17.323Z", "category": 1, "likes": [6]}}, {"model": "blog.post", "pk": 43, "fields": {"title": "No-Bake Cashew Blueberry Cheesecake", "slug": "no-bake-cashew-blueberry-cheesecake", "author": 1, "featured_image": "image/upload/v1712766344/yvfqsmvyhahdjnwbye6o.jpg", "content": "<p><strong>Ingredients:</strong></p>\r\n\r\n<p><strong>&nbsp;For the Crust:&nbsp;</strong><br />\r\n- 1 cup mixed nuts (such as almonds, walnuts, pecans)<br />\r\n- 1/2 cup pitted dates<br />\r\n- 2 tablespoons cocoa powder<br />\r\n- Pinch of salt</p>\r\n\r\n<p><strong>&nbsp;For the Filling:</strong><br />\r\n- 2 cups raw cashews (soaked overnight or for at least 4 hours)<br />\r\n- 1/2 cup coconut cream<br />\r\n- 1/4 cup maple syrup<br />\r\n- 1/4 cup lemon juice<br />\r\n- 1 teaspoon vanilla extract<br />\r\n- 1 cup fresh blueberries</p>\r\n\r\n<p><strong>&nbsp;For the Topping:</strong><br />\r\n- Fresh blueberries<br />\r\n- Edible flowers</p>\r\n\r\n<p>&nbsp;<strong>Instructions</strong>:</p>\r\n\r\n<p>1. Prepare the Crust:<br />\r\n1. In a food processor, combine the mixed nuts, pitted dates, cocoa powder, and a pinch of salt.<br />\r\n2. Pulse until the mixture resembles coarse crumbs and sticks together when pressed.</p>\r\n\r\n<p>2. Make the Filling:<br />\r\n1. Drain the soaked cashews and add them to a blender.<br />\r\n2. Add coconut cream, maple syrup, lemon juice, and vanilla extract.<br />\r\n3. Blend until smooth and creamy, scraping down the sides as needed.<br />\r\n4. Fold in the fresh blueberries gently.</p>\r\n\r\n<p>3. Assemble the Cheesecake:<br />\r\n1. Press the crust mixture into the bottom of a lined cake pan or springform pan.<br />\r\n2. Pour the cashew blueberry filling over the crust and smooth the top with a spatula.<br />\r\n3. Place the cheesecake in the freezer to set for at least 4 hours or overnight.</p>\r\n\r\n<p>4. Serve:<br />\r\n1. Before serving, remove the cheesecake from the freezer and let it sit at room temperature for a few minutes to soften slightly.<br />\r\n2. Garnish with fresh blueberries and edible flowers.<br />\r\n3. Slice and enjoy!</p>\r\n\r\n<p>&nbsp;</p>", "created_on": "2024-04-10T16:25:45.503Z", "status": 1, "excerpt": "Indulge in the luscious harmony of our Vegan No-Bake Cashew Blueberry Cheesecake—each velvety bite, a symphony of creamy cashews, juicy blueberries, and decadent chocolate crust, crowned with delicate edible flowers for an exquisite finishing touch.", "updated_on": "2024-04-10T16:25:45.503Z", "category": 4, "likes": [1]}}, {"model": "blog.post", "pk": 44, "fields": {"title": "Delicious Fruit Bowl with Dark Chocolate", "slug": "delicious-fruit-bowl-with-dark-chocolate", "author": 1, "featured_image": "image/upload/v1712766580/q7ujtxsnlluetjoacqum.jpg", "content": "<p>Ingredients:</p>\r\n\r\n<p>- 1 apple, sliced<br />\r\n- 1 pear, sliced<br />\r\n- 1 mango, diced<br />\r\n- Seeds of 1 pomegranate<br />\r\n- Assorted berries (such as strawberries, blueberries, raspberries)<br />\r\n- 2 kiwis, peeled and sliced<br />\r\n- 2 clementines, segmented<br />\r\n- Dark chocolate, chopped</p>\r\n\r\n<p>Instructions:</p>\r\n\r\n<p>1. Arrange the sliced apple, pear, mango, and kiwi in a large bowl.<br />\r\n2. Add the pomegranate seeds, assorted berries, and clementine segments.<br />\r\n3. Sprinkle the chopped dark chocolate over the fruit.<br />\r\n4. Toss gently to combine.<br />\r\n&nbsp;</p>", "created_on": "2024-04-10T16:29:41.104Z", "status": 1, "excerpt": "Savor the vibrant medley of fruits kissed by dark chocolate—a perfect snack to invigorate your day with energy, vitamins, minerals, fiber, and a touch of sweetness to indulge your cravings.", "updated_on": "2024-04-11T09:37:57.338Z", "category": 4, "likes": [4]}}, {"model": "blog.comment", "pk": 1, "fields": {"post": 39, "author": 2, "body": "that looks delicious", "approved": true, "created_on": "2024-04-11T09:53:45.144Z"}}]